# REFERENCES: 
# 
# - https://pumpingco.de/blog/brewfile
# - https://medium.com/@satorusasozaki/automate-mac-os-x-configuration-by-using-brewfile-58a78ce5cc53

# Specify --cask arguments
cask_args appdir: '/Applications', fontdir: '~/Library/Fonts'

# Add additional repositories not in the official homebrew formulae
tap 'dopplerhq/cli'
tap 'pantheon-systems/external'
tap 'homebrew/bundle'
tap 'homebrew/cask' || true
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'

# Install packages
brew 'autoenv'
brew 'certbot'
brew 'composer'
brew 'corepack'
brew 'curl'
brew 'dopplerhq/cli/doppler'
brew 'fx'
brew 'gh'
brew 'git'
brew 'gist'
brew 'gnupg', link: false
brew 'gpg2'
brew 'nvm'
brew 'openjdk'
brew 'openssl@3'
brew 'pantheon-systems/external/terminus'
brew 'php'
brew 'pinentry-mac'
brew 'python'
brew 'rcmdnk/file/brew-file'
brew 'tree'
brew 'vercel-cli'
brew 'zsh'

# Casks
cask 'adobe-creative-cloud'
cask 'docker'
cask 'chromium'
cask 'firefox-developer-edition'
cask 'gitkraken'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'lando'
cask 'mysqlworkbench'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code-insiders'
